In [ ]:
#  열 이름 바꾸기

In [ ]:
# 1) DataFrame.columns 메소드 
# 2) DataFrame.rename() 메소드 
# 3) DataFrame.set_axis() 메소드

In [1]:
import pandas as pd 

example_df = pd.DataFrame([
                ['John', 20, 45], 
                ['Peter', 21, 62], 
                ['Scot', 25, 68]],
                index=[0, 1, 2], 
                columns=['Name', 'Age', 'Marks'])

example_df

    Name  Age  Marks
0   John   20     45
1  Peter   21     62
2   Scot   25     68

In [3]:
# 컬럼이름을 바꿔보자  using DataFrame.columns 메소드 

example_df.columns = ["이름","나이","점수"]
example_df

      이름  나이  점수
0   John  20  45
1  Peter  21  62
2   Scot  25  68

In [5]:
# 다른 예시 

import pandas as pd

example_df = pd.DataFrame([['John', 20, 45, 78], 
                           ['Peter', 21, 62, 68], 
                           ['Scot', 25, 68, 95]],
                           index=[0, 1, 2], 
                           columns=['Name', 'Age', 'Marks','Roll_no'])


example_df

    Name  Age  Marks  Roll_no
0   John   20     45       78
1  Peter   21     62       68
2   Scot   25     68       95

In [7]:
# 컬럼을 바꾸어 보자 using DataFrame.rename() 메소드 

example_df.rename(columns = {"Name":"이름","Age":"나이"}, inplace = True)
example_df

      이름  나이  Marks  Roll_no
0   John  20     45       78
1  Peter  21     62       68
2   Scot  25     68       95

In [3]:
# 다른 예시 

import pandas as pd

example_df = pd.DataFrame([['John', 20, 45, 78], 
                           ['Peter', 21, 62, 68], 
                           ['Scot', 25, 68, 95]],
                           index=[0, 1, 2], 
                           columns=['Name', 'Age', 'Marks','Roll_no'])

example_df

    Name  Age  Marks  Roll_no
0   John   20     45       78
1  Peter   21     62       68
2   Scot   25     68       95

In [4]:
# 열 이름을 바꾸어보자  using DataFrame.set_axis() 메소드

example_df.set_axis(["이름","나이","점수","번호"],
                   axis = "columns", inplace= True)

example_df

      이름  나이  점수  번호
0   John  20  45  78
1  Peter  21  62  68
2   Scot  25  68  95

In [ ]:
# 열에 함수를 적용해 보기 
# apply() 메소드 >> 열이나 행에 걸쳐 전체 DataFrame에 대한 함수를 적용
# object.apply(func, axis = 0)

In [6]:
import pandas as pd 
import numpy as np 


df = pd.DataFrame([[5,6,7,8],[1,9,12,14],[4,8,10,6]], 
            columns = ['a','b','c','d'])
df

   a  b   c   d
0  5  6   7   8
1  1  9  12  14
2  4  8  10   6

In [7]:
# apply 에 적용할 함수를 만들어보자 

def x(a):
    return a + 1

df_new = df.apply(x, axis = 1)
df_new

   a   b   c   d
0  6   7   8   9
1  2  10  13  15
2  5   9  11   7

In [8]:
# 다른 예시 

import pandas as pd
import numpy as np

df = pd.DataFrame([
                    [5,6,7,8],
                    [1,9,12,14],
                    [4,8,10,6]
                    ],
                  columns = ['a','b','c','d'])

print("The original dataframe:")
print(df)

def func(x):
    return x[0] + x[1]  

df["e"] = df.apply(func, axis = 1)
df

The original dataframe:
   a  b   c   d
0  5  6   7   8
1  1  9  12  14
2  4  8  10   6

   a  b   c   d   e
0  5  6   7   8  11
1  1  9  12  14  10
2  4  8  10   6  12

In [10]:

df = pd.DataFrame([
                    [5,6,7,8],
                    [1,9,12,14],
                    [4,8,10,6]
                    ],
                  columns = ['a','b','c','d'])

df

   a  b   c   d
0  5  6   7   8
1  1  9  12  14
2  4  8  10   6

In [14]:
df = pd.DataFrame([
                    [5,6,7,8],
                    [1,9,12,14],
                    [4,8,10,6]
                    ],
                  columns = ['a','b','c','d'])
df

   a  b   c   d
0  5  6   7   8
1  1  9  12  14
2  4  8  10   6

In [15]:
# lambda 함수은 보다 간단한 함수를 만들 때 사용!! 
# 사용자 정의 함수는 좀 복잡한 함수를 만들 때 사용 !!

df["e"]= df.apply(lambda x: x["a"] + x["c"], axis= 1 )
df

   a  b   c   d   e
0  5  6   7   8  12
1  1  9  12  14  13
2  4  8  10   6  14

In [ ]:
# 여러 열 선택 해보기 
#  __getitem__ 구문 
#  iloc.() 또는 loc() 메서드

In [17]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.rand(4,4), columns = ["a","b","c","d"])
df

          a         b         c         d
0  0.929519  0.653352  0.965218  0.589583
1  0.268748  0.473776  0.747130  0.025476
2  0.723073  0.968949  0.459547  0.222578
3  0.824352  0.922694  0.894918  0.047802

In [18]:
# 추출 할 열 이름을 목록에 저장 한 다음[]에 전달하면 DataFrame에서 여러 열을 선택할 수 있음
# 이 방법은 only column에만 적용
df[["a","c"]]

          a         c
0  0.929519  0.965218
1  0.268748  0.747130
2  0.723073  0.459547
3  0.824352  0.894918

In [23]:
# iloc() 및 loc()메서드를 사용


import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.rand(4,4), columns = ['a','b','c','d'])
df.iloc[:,[0,1]]  # 모든행과 1 , 2열만 불러오기 
# iloc 는 인덱스번호로 불러오는 방법

          a         b
0  0.735651  0.774330
1  0.775728  0.625233
2  0.041322  0.347126
3  0.503318  0.777486

In [24]:
df.loc[:,["a","d"]] # 모든행과 a, d열만 불러오기 
# loc는 column 이름으로  불러오는 방법

          a         d
0  0.735651  0.041234
1  0.775728  0.711786
2  0.041322  0.634575
3  0.503318  0.816267

In [28]:
# column를 열 index로 바꿔보자 
# set_index(Column_name,inplace = True)

ColNames = ['Name','Time','Course']

df = pd.DataFrame([['Jay',10,'B.Tech'],['Raj',12,'BBA'],['Jack',11,'B.Sc']],
             columns = ColNames )

df

   Name  Time  Course
0   Jay    10  B.Tech
1   Raj    12     BBA
2  Jack    11    B.Sc

In [30]:
df.set_index("Name", inplace = True)
df

      Time  Course
Name
Jay     10  B.Tech
Raj     12     BBA
Jack    11    B.Sc

In [34]:
ColNames = ['Name','Time','Course']

df = pd.DataFrame([['Jay',10,'B.Tech'],['Raj',12,'BBA'],['Jack',11,'B.Sc']],
             columns = ColNames )

df

   Name  Time  Course
0   Jay    10  B.Tech
1   Raj    12     BBA
2  Jack    11    B.Sc

In [35]:
df.set_index(["Name","Course"], inplace = True)
df

             Time
Name Course
Jay  B.Tech    10
Raj  BBA       12
Jack B.Sc      11

In [37]:
# NaN 발생 횟수를 계산하는 방법
# 1. isna() 메서드

import pandas as pd 
import numpy as np 

df = pd.DataFrame({"a":[1,2,np.nan],"b":[np.nan,1, np.nan]}, index = ["일","이","삼"])
df

In [41]:
print(df.isna()) # NaN 이 있으면 True 반환 없으면 False
print("\n")
print(df.isna().sum())

       a      b
일  False   True
이  False  False
삼   True   True


a    1
b    2
dtype: int64

In [42]:
# 2. df의 길이에서 non-Nan발생횟수를 빼기 

import pandas as pd

df = pd.DataFrame([
    (1,2,None),
    (None,4,None),
    (5,None,7),
    (5,None,None)], 
    columns=['a','b','d'], 
    index = ['A', 'B','C','D'])

df

     a    b    d
A  1.0  2.0  NaN
B  NaN  4.0  NaN
C  5.0  NaN  7.0
D  5.0  NaN  NaN

In [46]:
#  df 행 ,열 갯수세기 

len(df)  # 행 겟수 세기 ( = len(df.index) // df.shape[0])

4

In [47]:
df.count()  # Null 값이 아닌 행 개수 세기

a    3
b    2
d    1
dtype: int64

In [48]:
len(df.columns)   # column 갯수 세기  = df.shape[1]

3

In [49]:
len(df) - df.count()

a    1
b    2
d    3
dtype: int64

In [51]:
#  3. isnull()

import pandas as pd

df = pd.DataFrame([(1,2,None),
    (None,4,None),
    (5,None,7),
    (5,None,None)], columns = ['a','b','d'], index = ['A', 'B','C','D'])

df

     a    b    d
A  1.0  2.0  NaN
B  NaN  4.0  NaN
C  5.0  NaN  7.0
D  5.0  NaN  NaN

In [52]:
df.isnull()  # NaN 이면 True 반환

       a      b      d
A  False  False   True
B   True  False   True
C  False   True  False
D  False   True   True

In [53]:
df.isnull().sum(axis = 0)

a    1
b    2
d    3
dtype: int64

In [54]:
df.isnull().sum(axis =1)

A    1
B    2
C    1
D    2
dtype: int64

In [1]:
# columns 을 순서를 다시 재배열하자 


import pandas as pd
df = pd.DataFrame({'a':['1','2','3','4'], 
                   'b': [16,7,6,16],
                   'c':[61,57,16,36],
                   'd':['12','22','13','44'],
                   'e':['Green','Red','Blue','Yellow'],
                   'f':[1,11,23,66]})
df

   a   b   c   d       e   f
0  1  16  61  12   Green   1
1  2   7  57  22     Red  11
2  3   6  16  13    Blue  23
3  4  16  36  44  Yellow  66

In [2]:
## 1. df[[]] 사용하기 

df[["f","e","d","c","b","a"]]

    f       e   d   c   b  a
0   1   Green  12  61  16  1
1  11     Red  22  57   7  2
2  23    Blue  13  16   6  3
3  66  Yellow  44  36  16  4

In [5]:
## 특정위치에 새 열을 삽입해보자(
# insert () 메서드 사용)
# insert(위치, 새로운 column 열 이름, 열 값)

df.insert(0, "NewColMean", df.mean(1))

In [6]:
df

   NewColMean    New_Col  a   b   c   d       e   f
0   26.000000  26.000000  1  16  61  12   Green   1
1   25.000000  25.000000  2   7  57  22     Red  11
2   15.000000  15.000000  3   6  16  13    Blue  23
3   39.333333  39.333333  4  16  36  44  Yellow  66

In [7]:
# reindex ()

import pandas as pd
df = pd.DataFrame({'a':['1','2','3','4'], 
                   'b': [16,7,6,16],
                   'c':[61,57,16,36],
                   'd':['12','22','13','44'],
                   'e':['Green','Red','Blue','Yellow'],
                   'f':[1,11,23,66]})

df

   a   b   c   d       e   f
0  1  16  61  12   Green   1
1  2   7  57  22     Red  11
2  3   6  16  13    Blue  23
3  4  16  36  44  Yellow  66

In [8]:
df.reindex(columns = ["A","B","C","D","E","F"])
df

   a   b   c   d       e   f
0  1  16  61  12   Green   1
1  2   7  57  22     Red  11
2  3   6  16  13    Blue  23
3  4  16  36  44  Yellow  66

In [ ]:
# 열의 데이터 유형을 변경해보자
# to_numberic 메소드 (열을 숫자값으로 변환하는 )
# astype()  (한 유형을 다른 유형으로 변환하는 )
# infer_object()  ( 열 데이터 유형을 보다 구체적인 유형을 변환)

In [9]:
import pandas as pd
s = pd.Series([
    '12', '12', '4.7', 'asad', '3.0'])
s

0      12
1      12
2     4.7
3    asad
4     3.0
dtype: object

In [10]:
# to_number()  숫자가아닌 값을 숫자로 바꿀 때 씀/ 숫자로 변환 할 수 없는 경우에는 NaN 값이 됨 

import pandas as pd
s = pd.Series([
    '12', '12', '4.7', 'asad', '3.0'])
print(s)

0      12
1      12
2     4.7
3    asad
4     3.0
dtype: object

In [16]:
pd.to_numeric(s,errors = "coerce")

0    12.0
1    12.0
2     4.7
3     NaN
4     3.0
dtype: float64

In [17]:
import pandas as pd
s = pd.Series([-3, 1, -5])
print(s)

0   -3
1    1
2   -5
dtype: int64

In [18]:
pd.to_numeric(s,downcast = "integer" )

0   -3
1    1
2   -5
dtype: int8

In [22]:
# astype()
# 한 데이터 유형을 다른 데이터 유형으로 바꾸기 
import pandas as pd 

c = [['x', '1.23', '14.2'], 
     ['y', '20', '0.11'],
     ['z', '3', '10']]
     
df = pd.DataFrame(c,columns = ["First","Second","Thrid"] )
     
df

  First Second Thrid
0     x   1.23  14.2
1     y     20  0.11
2     z      3    10

In [24]:
df.info()  # 3개의 열 전부다 object, 문자라는것을 알 수 있다

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   First   3 non-null      object
 1   Second  3 non-null      object
 2   Thrid   3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [30]:
#  2열을 float 로 바꿔보자 
df["Second"].astype(float)

0     1.23
1    20.00
2     3.00
Name: Second, dtype: float64

In [38]:
# infer_objects() 메소드를 사용하여 열 데이터 유형을 보다 구체적인 유형으로 변환 


import pandas as pd
df = pd.DataFrame({
    'a': [3, 12, 5], 
    'b': [3.0,2.6,1.1]})
df

    a    b
0   3  3.0
1  12  2.6
2   5  1.1

In [39]:
df.dtypes

a      int64
b    float64
dtype: object

In [42]:

import pandas as pd
df = pd.DataFrame({
    'a': [3, 12, 5], 
    'b': [3.0,2.6,1.1]}, dtype = "object")
df

    a    b
0   3  3.0
1  12  2.6
2   5  1.1

In [44]:
df.dtypes

a    object
b    object
dtype: object

In [49]:
df2 = df.infer_objects()
df2

    a    b
0   3  3.0
1  12  2.6
2   5  1.1

In [48]:
df2.dtypes

a      int64
b    float64
dtype: object

In [50]:
# DataFrame에서 두 개의 텍스트 열 결합
# + // df.map() // df.apply() // Series.str.cat() // df.agg() 



import pandas as pd
data = [
    ['Ali',
     'Azmat',
     '30'],
    ['Sharukh',
     'Khan',
     '40'],
    ['Linus',
     'Torvalds',
     '70']
]
df = pd.DataFrame(data, columns = ["First","Last","Age"])
df

     First      Last Age
0      Ali     Azmat  30
1  Sharukh      Khan  40
2    Linus  Torvalds  70

In [51]:
# Using + (더하기)를 사용하여 full name을 만들어보자

df["Full Name"] = df["First"]+" " + df["Last"]
df

     First      Last Age       Full Name
0      Ali     Azmat  30       Ali Azmat
1  Sharukh      Khan  40    Sharukh Khan
2    Linus  Torvalds  70  Linus Torvalds

In [ ]:
## 잠깐!! map() 의 기능을 한번 보자 
# map(function, iterable) >>   function 은 함수가 오고 iterabl은 반복가능한 자료형(리스트, 튜플 등)이 옵니다. 
# map함수의 반환 값은 " map 객체 이기 때문에 해당 자료형을 list, 혹은 tuple 형으로 변환시켜주어야 한다"

In [58]:
# map을 이용했을 때와 안 했을 때의 차이 

print("map함수 이용 안 했을 때")
myList = [1, 2, 3, 4, 5]
result1 = []
for i in myList:
    result1.append(i)
    
print("result1:{}".format(result1))

map함수 이용 안 했을 때
result1:[1, 2, 3, 4, 5]

In [61]:
print("map함수 이용 했을 때")

myList = [1, 2, 3, 4, 5]

def function(x):
    return x


result2 = list(map(function,myList))
result2

map함수 이용 했을 때

[1, 2, 3, 4, 5]

In [65]:
# map 함수의 예를 더 보자 

list1 = [1.1, 2.2, 3.3, 4.4, 5.5]

import math 

result1 = list(map(int, list1))
print("result1의 결과값 {}".format(result1))

result1의 결과값 [1, 2, 3, 4, 5]

In [72]:
list2 = [1.1, 2.2, 3.3, 4.4, 5.5]

def function_pow(x):
    return round(pow(x,2),1)

result2 = list(map(function_pow, list2))
print("result2의 결과값 {}".format(result2))

result2의 결과값 [1.2, 4.8, 10.9, 19.4, 30.2]

In [75]:
# map(함수, 순차적 자료)
# map에 적용할 함수는 1) 사용자 정의 함수도 되지만 2) lambda 함수도 된다 
# lambda 함수는  사용할 함수가 일회성이거나 매우 짦은 경우에 사용하는 것 
# 일반함수와  람다함수를 비교해보자

print("일반 함수")

number_list = [5,4,3,2,1]

def func1(x):
    return x * 2
result1 = list(map(func1,number_list))
result1

일반 함수

[10, 8, 6, 4, 2]

In [76]:
print("람다함수 이용")
number_list = [5,4,3,2,1]
result2 = list(map(lambda x: x * 2, number_list))
result2

람다함수 이용

[10, 8, 6, 4, 2]

In [77]:
# using df.map()를 하여 두 열의 텍스트를 결합 할 수 있음 

import pandas as pd 

data = [
    ['Ali',
     'Azmat',
     '30'],
    ['Sharukh',
     'Khan',
     '40'],
    ['Linus',
     'Torvalds',
     '70']
]

df = pd.DataFrame(data, columns = ["First",'Last',"Age"])
df

     First      Last Age
0      Ali     Azmat  30
1  Sharukh      Khan  40
2    Linus  Torvalds  70

In [79]:
df["Full Name"] = df["First"].map(str) + " " + df["Last"]
df

     First      Last Age       Full Name
0      Ali     Azmat  30       Ali Azmat
1  Sharukh      Khan  40    Sharukh Khan
2    Linus  Torvalds  70  Linus Torvalds

In [80]:
# df.apply() 메소드 

import pandas as pd 

data = [
    ['Ali',
     'Azmat',
     '30'],
    ['Sharukh',
     'Khan',
     '40'],
    ['Linus',
     'Torvalds',
     '70']
]

df = pd.DataFrame(data, columns = ["First",'Last',"Age"])
df

     First      Last Age
0      Ali     Azmat  30
1  Sharukh      Khan  40
2    Linus  Torvalds  70

In [81]:
# apply() 메서드를 활용하여  함수를 적용해보자 

# 인수로 행이나 열을 받는 함수를 apply 메서드의 인수로 넣으면 데이터프레임의 행이나 열들을 하나씩 함수에 전달
# 구문  df.apply(함수, axis = 0, args = ())
# 함수: df의 행들 또는 열들을 전달함 함수 
# 0 - 행, 1은 열을 전달 

df["Full Name"] = df[["First","Last"]].apply(" ".join, axis = 1)
df

     First      Last Age       Full Name
0      Ali     Azmat  30       Ali Azmat
1  Sharukh      Khan  40    Sharukh Khan
2    Linus  Torvalds  70  Linus Torvalds

In [82]:
# Series.str.cat() 메소드를 사용하여 지정된 구분 기호로 Series/Index 의 문자열을 연결할 수 있음 

import pandas as pd 
data = [
    ['Ali',
     'Azmat',
     '30'],
    ['Sharukh',
     'Khan',
     '40'],
    ['Linus',
     'Torvalds',
     '70']
]

df = pd.DataFrame(data, columns = ["First",'Last',"Age"])
df

     First      Last Age
0      Ali     Azmat  30
1  Sharukh      Khan  40
2    Linus  Torvalds  70

In [86]:
# str.cat() 메서드 사용 
# A.str.cat.B 이렇게 사용

df["Full Name"] = df["First"].str.cat(df["Last"],sep= " ")
df

     First      Last Age       Full Name
0      Ali     Azmat  30       Ali Azmat
1  Sharukh      Khan  40    Sharukh Khan
2    Linus  Torvalds  70  Linus Torvalds

In [87]:
df["Full Name"] = df["First"].str.cat(df["Last"],sep= "**")
df

     First      Last Age        Full Name
0      Ali     Azmat  30       Ali**Azmat
1  Sharukh      Khan  40    Sharukh**Khan
2    Linus  Torvalds  70  Linus**Torvalds

In [88]:
import pandas as pd

df = pd.DataFrame({'name': ['Alice', 'Bob', 'Charlie']
                      , 'age': [24, 42, 35]
                      , 'state': ['NY', 'CA', 'LA']
                      , 'point': [64, 92, 75]})

df

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   35    LA     75

In [90]:
df["name"].str.cat(["X","Y","Z"], sep = " in ")

0      Alice in X
1        Bob in Y
2    Charlie in Z
Name: name, dtype: object

In [91]:
# Pandas.Series 또는 리스트를 지정하고 단일 문자열을 지정하는 경우에는 에러 발생
df["name"].str.cat("X", sep = " - ")

ValueError: Did you mean to supply a `sep` keyword?

In [92]:
# df.agg() 메서드

import pandas as pd 
data = [
    ['Ali',
     'Azmat',
     '30'],
    ['Sharukh',
     'Khan',
     '40'],
    ['Linus',
     'Torvalds',
     '70']
]

df = pd.DataFrame(data, columns = ["First",'Last',"Age"])
df

     First      Last Age
0      Ali     Azmat  30
1  Sharukh      Khan  40
2    Linus  Torvalds  70

In [94]:
df["Full Name"] = df[["First","Last"]].agg(" ".join, axis = 1)
df

     First      Last Age       Full Name
0      Ali     Azmat  30       Ali Azmat
1  Sharukh      Khan  40    Sharukh Khan
2    Linus  Torvalds  70  Linus Torvalds